demo.yml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: jmeter
  scenario: blazedemo-http
  concurrency: 10
  ramp-up: 10s
  hold-for: 10s

scenarios:
  blazedemo-http:
    headers:
      sec-ch-ua: '".Not/A)Brand";v="99", "Google Chrome";v="103", "Chromium";v="103"'
      sec-ch-ua-mobile: '?0'
      sec-ch-ua-platform: '"Windows"'
      User-Agent: 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/103.0.0.0 Safari/537.36'
    requests:
      - transaction: Landing Page
        force-parent-sample: false
        do:
          - url: 'https://blazedemo.com/'
            method: GET
            label: 'https://blazedemo.com/'
            think-time: 0ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9'
          - url: 'https://blazedemo.com/assets/bootstrap.min.js'
            method: GET
            label: 'https://blazedemo.com/assets/bootstrap.min.js'
            headers:
              Accept: '*/*'
          - url: 'https://blazedemo.com/assets/bootstrap-table.js'
            method: GET
            label: 'https://blazedemo.com/assets/bootstrap-table.js'
            headers:
              Accept: '*/*'
      - transaction: Find Flights
        force-parent-sample: false
        do:
          - url: 'https://blazedemo.com/reserve.php'
            method: POST
            label: 'https://blazedemo.com/reserve.php'
            think-time: 19821ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Content-Type: application/x-www-form-urlencoded
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9'
            body:
              fromPort: Paris
              toPort: Berlin
          - url: 'https://blazedemo.com/assets/bootstrap.min.js'
            method: GET
            label: 'https://blazedemo.com/assets/bootstrap.min.js'
            headers:
              Accept: '*/*'
          - url: 'https://blazedemo.com/assets/bootstrap-table.js'
            method: GET
            label: 'https://blazedemo.com/assets/bootstrap-table.js'
            headers:
              Accept: '*/*'
      - transaction: Choose This Flight
        force-parent-sample: false
        do:
          - url: 'https://blazedemo.com/purchase.php'
            method: POST
            label: 'https://blazedemo.com/purchase.php'
            think-time: 16658ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Content-Type: application/x-www-form-urlencoded
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9'
            body:
              airline: Virgin America
              flight: '12'
              fromPort: Paris
              price: '765.32'
              toPort: Berlin
          - url: 'https://blazedemo.com/assets/bootstrap.min.js'
            method: GET
            label: 'https://blazedemo.com/assets/bootstrap.min.js'
            headers:
              Accept: '*/*'
          - url: 'https://blazedemo.com/assets/bootstrap-table.js'
            method: GET
            label: 'https://blazedemo.com/assets/bootstrap-table.js'
            headers:
              Accept: '*/*'
      - transaction: Purchase Flight
        force-parent-sample: false
        do:
          - url: 'https://blazedemo.com/confirmation.php'
            method: POST
            label: 'https://blazedemo.com/confirmation.php'
            think-time: 21268ms
            headers:
              Upgrade-Insecure-Requests: '1'
              Content-Type: application/x-www-form-urlencoded
              Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.9'
            body:
              _token: ''
              address: ''
              cardType: visa
              city: ''
              creditCardMonth: '11'
              creditCardNumber: ''
              creditCardYear: '2017'
              inputName: ''
              nameOnCard: ''
              rememberMe: 'on'
              state: ''
              zipCode: ''
          - url: 'https://blazedemo.com/assets/bootstrap.min.js'
            method: GET
            label: 'https://blazedemo.com/assets/bootstrap.min.js'
            headers:
              Accept: '*/*'
          - url: 'https://blazedemo.com/assets/bootstrap-table.js'
            method: GET
            label: 'https://blazedemo.com/assets/bootstrap-table.js'
            headers:
              Accept: '*/*'

settings:
  artifacts-dir: artifacts/%Y-%m-%d_%H-%M-%S.%f